app/views/bookings/new.html.erb

      <%= f.label :event %><br>
      <%= collection_select( :booking, :event_id , Event.all, :id, :name) %>
---
SELECT "events".* FROM "events"