app/views/bookings/show.html.erb

      <td><%= @booking.user.email %></td>
      <td><%= @booking.user.roles.last.name %></td>
---
SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = $1 ORDER BY "roles"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]