app/views/users/_form.html.erb

        <%= f.label :role %><br>
        <%=  collection_select( :users, :role_id , Role.all, :id, :name) %>
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
SELECT "roles".* FROM "roles"