app/views/events/_form.html.erb

SELECT "categories".* FROM "categories"
---
      <%= f.label :category %><br>
      <%= collection_select( :event, :category_id , Category.all, :id, :name)%>

SELECT "locations".* FROM "locations"
---
    <%= f.label :location %><br>
    <%= collection_select( :event, :location_id , Location.all, :id, :name)%>