app/views/events/index.html.erb

      <td><%= u.category.name %></td>
      <td><%= u.location.capacity - u.bookings.sum(:capacity) %></td>
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT SUM("bookings"."capacity") FROM "bookings" WHERE "bookings"."event_id" = $1  [["event_id", 2]]