app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings"
---
  def index
    @bookings =Booking.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "bookings" ("status", "reason", "capacity", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["status", 0], ["reason", nil], ["capacity", 20], ["user_id", 6], ["event_id", 13], ["created_at", "2022-06-21 08:50:41.384001"], ["updated_at", "2022-06-21 08:50:41.384001"]]
---
  def create
    @user = User.find(params[:user_id])

    @booking = @user.bookings.new(booking_params)
    if @booking.save

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @booking = Booking.find(params[:format])

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def confirm
      @booking = Booking.find(params[:booking_id])

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
   def cancle
     @booking = Booking.find(params[:booking_id])