app/controllers/categories_controller.rb

  def index
    @categories= Category.all.order(created_at: :desc)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."created_at" DESC

  def create
     @category= Category.new(cat_params)
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "f"], ["created_at", "2022-06-18 19:36:30.595426"], ["updated_at", "2022-06-18 19:36:30.595426"]]