app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
  def index
    @cities =City.all

INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Surat"], ["created_at", "2022-06-19 18:06:00.321797"], ["updated_at", "2022-06-19 18:06:00.321797"]]
---
  def create
    @city= City.new(city_params)
    if @city.save