app/controllers/events_controller.rb

  def create
    @event=   Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("name", "start_time", "end_time", "location_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]