app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

  def create

    @location = Location.new(location_params)
    if @location.save
---
INSERT INTO "locations" ("name", "address", "capacity", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "vasna"], ["address", "aa"], ["capacity", 40], ["city_id", 3], ["created_at", "2022-06-20 05:55:43.272281"], ["updated_at", "2022-06-20 05:55:43.272281"]]