app/controllers/notifications_controller.rb

  def index
    @notification = Notification.all
---
SELECT "notifications".* FROM "notifications"