app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles"
---
  def index
    @roles = Role.all

INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "admin"], ["created_at", "2022-06-20 05:18:01.021853"], ["updated_at", "2022-06-20 05:18:01.021853"]]
---
  def create
    @role= Role.new(role_params)
    if @role.save

SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "roles" WHERE "roles"."id" = $1  [["id", 4]]
---
  def destroy
    @role=Role.find(params[:id])
    @role.destroy