app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users= User.all.order(created_at: :desc)

INSERT INTO "users" ("name", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "mona"], ["phone", "2466414214"], ["email", "mona@gmail.com"], ["created_at", "2022-06-18 19:09:10.959173"], ["updated_at", "2022-06-18 19:09:10.959173"]]
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "users" ("name", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "margi"], ["phone", "213424242"], ["email", "m@gmail.com"], ["created_at", "2022-06-21 11:40:01.962226"], ["updated_at", "2022-06-21 11:40:01.962226"]]
---
  def create
    @user= User.new(user_params)
    @user.roles << Role.find_by(id: params[:users][:role_id])
    if @user.save