app/models/booking.rb

    def create_notification
      self.notifications.create(message:"#{self.user.name}  booking ")
---
INSERT INTO "notifications" ("created_at", "updated_at", "notifiable_type", "notifiable_id", "message") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-06-21 11:41:40.384888"], ["updated_at", "2022-06-21 11:41:40.384888"], ["notifiable_type", "Booking"], ["notifiable_id", 12], ["message", "pending booking "]]