app/models/event.rb

INSERT INTO "notifications" ("created_at", "updated_at", "notifiable_type", "notifiable_id", "message") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-06-20 11:51:17.164721"], ["updated_at", "2022-06-20 11:51:17.164721"], ["notifiable_type", "Event"], ["notifiable_id", 14], ["message", "dance event created"]]
---
    def create_notification
      self.notifications.create(message:"#{self.name} booking ")