app/views/locations/_form.html.erb

SELECT "cities".* FROM "cities"
---
    <%= f.label :city %><br>
    <%=  collection_select( :location, :city_id , City.all, :id, :name) %>